Revit 2024 API
BuiltInFailures.RebarShapeFailures.HooksAndEndTreatmentAtTheSameEnd Property
 Cannot add hooks and end treatments at the same end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HooksAndEndTreatmentAtTheSameEnd { get; }
Visual Basic
Public Shared ReadOnly Property HooksAndEndTreatmentAtTheSameEnd As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HooksAndEndTreatmentAtTheSameEnd {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace